In [2]:
import pandas as pd
import numpy as np

series in panda

In [3]:
s = pd.Series([10,20,30,40])
s

0    10
1    20
2    30
3    40
dtype: int64

In [4]:
#custom index
s= pd.Series([10,20,30,40], index=['a','b','c','d'])
s1= pd.Series([10,34,5,423,34,], index=['1','2','3','4','50'])
s
s1

1      10
2      34
3       5
4     423
50     34
dtype: int64

In [5]:
#acces element that u have custom implemented.
print(s["a"])

10

series from dictionay

In [6]:
data = {"math": 85, "science": 90, "english": 78}
print(data)
marks = pd.Series(data)
print(marks)

{'math': 85, 'science': 90, 'english': 78}
math       85
science    90
english    78
dtype: int64

data frrame in pandas

In [7]:
set = { 
    "name": ["aksh","aman","sagar","sehab"],
    "age": [20,22,21,23],
    "marks":[28,125,12,45]

}
print(set)

{'name': ['aksh', 'aman', 'sagar', 'sehab'], 'age': [20, 22, 21, 23], 'marks': [28, 125, 12, 45]}

In [8]:
set1 = pd.DataFrame(set)
set1
#that  0  1 2  3 index that was create by defaulty in pandas range index

    name  age  marks
0   aksh   20     28
1   aman   22    125
2  sagar   21     12
3  sehab   23     45

In [9]:
set2 = pd.DataFrame(set,index=["student1","student2","student3","student4"])
set2

           name  age  marks
student1   aksh   20     28
student2   aman   22    125
student3  sagar   21     12
student4  sehab   23     45

In [10]:
# set1.set_index("name", inplace=True)
# set1
#if we are seting in palace  = true it means we are changing the original dataframe instead of creating a new one.

In [11]:
print(set1)

    name  age  marks
0   aksh   20     28
1   aman   22    125
2  sagar   21     12
3  sehab   23     45

In [12]:
#as the no of rows is less than 5 so the output of both df and df tails will ne identical
set1.head()

    name  age  marks
0   aksh   20     28
1   aman   22    125
2  sagar   21     12
3  sehab   23     45

In [13]:
set1.tail()

    name  age  marks
0   aksh   20     28
1   aman   22    125
2  sagar   21     12
3  sehab   23     45

In [14]:
set1.tail(3)
set1.head(2)

   name  age  marks
0  aksh   20     28
1  aman   22    125

In [15]:
set1.shape

(4, 3)

In [16]:
set1.columns
print(set1.dtypes)

name     object
age       int64
marks     int64
dtype: object

In [17]:
set1.info()
set1.dtypes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     4 non-null      int64
 2   marks   4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

name     object
age       int64
marks     int64
dtype: object

In [18]:
#describe = all discriptive value
set1.describe()

             age       marks
count   4.000000    4.000000
mean   21.500000   52.500000
std     1.290994   50.176356
min    20.000000   12.000000
25%    20.750000   24.000000
50%    21.500000   36.500000
75%    22.250000   65.000000
max    23.000000  125.000000

In [19]:
set1.describe().T

       count  mean        std   min    25%   50%    75%    max
age      4.0  21.5   1.290994  20.0  20.75  21.5  22.25   23.0
marks    4.0  52.5  50.176356  12.0  24.00  36.5  65.00  125.0

selecting the data

In [20]:
set1["age"]

0    20
1    22
2    21
3    23
Name: age, dtype: int64

In [21]:
#filtering in pandas
set1[set1["marks"] >= 85]

   name  age  marks
1  aman   22    125

In [22]:
#multiple condition
set1[(set1["age"] >= 21) & (set1["marks"] > 50)]

   name  age  marks
1  aman   22    125

In [23]:
#sorting and value count
set1.sort_values("marks")

    name  age  marks
2  sagar   21     12
0   aksh   20     28
3  sehab   23     45
1   aman   22    125

In [24]:
set1.sort_values("marks", ascending=False)

    name  age  marks
1   aman   22    125
3  sehab   23     45
0   aksh   20     28
2  sagar   21     12

In [25]:
set1.sort_values("marks", ascending=False)

    name  age  marks
1   aman   22    125
3  sehab   23     45
0   aksh   20     28
2  sagar   21     12

In [26]:
#count of that there is same or unique
set1["age"].value_counts()

age
20    1
22    1
21    1
23    1
Name: count, dtype: int64

In [27]:
set1["marks"].value_counts()

marks
28     1
125    1
12     1
45     1
Name: count, dtype: int64

Hamdling missing values

In [28]:
df = pd.DataFrame({
"name":["aman","shehab","sahil",None,"sagar"],
"age":[21,22,23,24,None],
"marks":[85,90,None,75,80]
}
)
df

     name   age  marks
0    aman  21.0   85.0
1  shehab  22.0   90.0
2   sahil  23.0    NaN
3    None  24.0   75.0
4   sagar   NaN   80.0

In [29]:
#check the missing values
#isnull() by default print where noone true
df.isnull()

    name    age  marks
0  False  False  False
1  False  False  False
2  False  False   True
3   True  False  False
4  False   True  False

In [30]:
#counting the missing fslues
df.isna().sum()

name     1
age      1
marks    1
dtype: int64

In [31]:
#it will show the count of missing values in each column
df.isnull().sum()

name     1
age      1
marks    1
dtype: int64

In [32]:
# drop the row
df.dropna()

     name   age  marks
0    aman  21.0   85.0
1  shehab  22.0   90.0

In [33]:
cleaned_data = df.dropna()
cleaned_data

     name   age  marks
0    aman  21.0   85.0
1  shehab  22.0   90.0